package cn.bdqn.random;

import java.util.Random;

/**
 * @title:RandonAddress
 * @Author SwayJike
 * @Date:2021/9/19 14:45
 * @Version 1.0
 */
public class RandomAddress {

    public static String nextAddress(){
        Random random = new Random();
        return address[random.nextInt(address.length)];
    }


    private static final String[] address = {
            "北京市市辖区东城区", "北京市市辖区西城区", "北京市市辖区崇文区", "北京市市辖区宣武区", "北京市市辖区朝阳区", "北京市市辖区丰台区", "北京市市辖区石景山区", "北京市市辖区海淀区", "北京市市辖区门头沟区", "北京市市辖区房山区"
            , "北京市市辖区通州区", "北京市市辖区顺义区", "北京市市辖区昌平区", "北京市市辖区大兴区", "北京市市辖区怀柔区", "北京市市辖区平谷区", "天津市市辖区和平区", "天津市市辖区河东区", "天津市市辖区河西区", "天津市市辖区南开区"
            , "天津市市辖区河北区", "天津市市辖区红桥区", "天津市市辖区塘沽区", "天津市市辖区汉沽区", "天津市市辖区大港区", "天津市市辖区东丽区", "天津市市辖区西青区", "天津市市辖区津南区", "天津市市辖区北辰区", "天津市市辖区武清区"
            , "天津市市辖区宝坻区", "河北省石家庄市市辖区", "河北省石家庄市长安区", "河北省石家庄市桥东区", "河北省石家庄市桥西区", "河北省石家庄市新华区", "河北省石家庄市井陉矿区", "河北省石家庄市裕华区", "河北省石家庄市井陉县", "河北省石家庄市正定县"
            , "河北省石家庄市栾城县", "河北省石家庄市行唐县", "河北省石家庄市灵寿县", "河北省石家庄市高邑县", "河北省石家庄市深泽县", "河北省石家庄市赞皇县", "河北省石家庄市无极县", "河北省石家庄市平山县", "河北省石家庄市元氏县", "河北省石家庄市赵"
            , "河北省石家庄市辛集市", "河北省石家庄市藁城市", "河北省石家庄市晋州市", "河北省石家庄市新乐市", "河北省石家庄市鹿泉市", "河北省唐山市市辖区", "河北省唐山市路南区", "河北省唐山市路北区", "河北省唐山市古冶区", "河北省唐山市开平区"
            , "河北省唐山市丰南区", "河北省唐山市丰润区", "河北省唐山市滦县", "河北省唐山市滦南县", "河北省唐山市乐亭县", "河北省唐山市迁西县", "河北省唐山市玉田县", "河北省唐山市唐海县", "河北省唐山市遵化市", "河北省唐山市迁安市"
            , "河北省秦皇岛市市辖区", "河北省秦皇岛市海港区", "河北省秦皇岛市山海关区", "河北省秦皇岛市北戴河区", "河北省秦皇岛市青龙满族自治县", "河北省秦皇岛市昌黎县", "河北省秦皇岛市抚宁县", "河北省秦皇岛市卢龙县", "河北省邯郸市市辖区", "河北省邯郸市邯山区"
            , "河北省邯郸市丛台区", "河北省邯郸市复兴区", "河北省邯郸市峰峰矿区", "河北省邯郸市邯郸县", "河北省邯郸市临漳县", "河北省邯郸市成安县", "河北省邯郸市大名县", "河北省邯郸市涉县", "河北省邯郸市磁县", "河北省邯郸市肥乡县"
            , "河北省邯郸市永年县", "河北省邯郸市邱县", "河北省邯郸市鸡泽县", "河北省邯郸市广平县", "河北省邯郸市馆陶县", "河北省邯郸市魏县", "河北省邯郸市曲周县", "河北省邯郸市武安市", "河北省邢台市市辖区", "河北省邢台市桥东区"
            , "河北省邢台市桥西区", "河北省邢台市邢台县", "河北省邢台市临城县", "河北省邢台市内丘县", "河北省邢台市柏乡县", "河北省邢台市隆尧县", "河北省邢台市任县", "河北省邢台市南和县", "河北省邢台市宁晋县", "河北省邢台市巨鹿县"
            , "河北省邢台市新河县", "河北省邢台市广宗县", "河北省邢台市平乡县", "河北省邢台市威县", "河北省邢台市清河县", "河北省邢台市临西县", "河北省邢台市南宫市", "河北省邢台市沙河市", "河北省保定市市辖区", "河北省保定市新市区"
            , "河北省保定市北市区", "河北省保定市南市区", "河北省保定市满城县", "河北省保定市清苑县", "河北省保定市涞水县", "河北省保定市阜平县", "河北省保定市徐水县", "河北省保定市定兴县", "河北省保定市唐县", "河北省保定市高阳县"
            , "河北省保定市容城县", "河北省保定市涞源县", "河北省保定市望都县", "河北省保定市安新县", "河北省保定市易县", "河北省保定市曲阳县", "河北省保定市蠡县", "河北省保定市顺平县", "河北省保定市博野县", "河北省保定市雄县"
            , "河北省保定市涿州市", "河北省保定市定州市", "河北省保定市安国市", "河北省保定市高碑店市", "河北省张家口市市辖区", "河北省张家口市桥东区", "河北省张家口市桥西区", "河北省张家口市宣化区", "河北省张家口市下花园区", "河北省张家口市宣化县"
            , "河北省张家口市张北县", "河北省张家口市康保县", "河北省张家口市沽源县", "河北省张家口市尚义县", "河北省张家口市蔚县", "河北省张家口市阳原县", "河北省张家口市怀安县", "河北省张家口市万全县", "河北省张家口市怀来县", "河北省张家口市涿鹿县"
            , "河北省张家口市赤城县", "河北省张家口市崇礼县", "河北省承德市市辖区", "河北省承德市双桥区", "河北省承德市双滦区", "河北省承德市鹰手营子矿区", "河北省承德市承德县", "河北省承德市兴隆县", "河北省承德市平泉县", "河北省承德市滦平县"
            , "河北省承德市隆化县", "河北省承德市丰宁满族自治县", "河北省承德市宽城满族自治县", "河北省承德市围场满族蒙古族自治县", "河北省沧州市市辖区", "河北省沧州市新华区", "河北省沧州市运河区", "河北省沧州市沧县", "河北省沧州市青县", "河北省沧州市东光县"
            , "河北省沧州市海兴县", "河北省沧州市盐山县", "河北省沧州市肃宁县", "河北省沧州市南皮县", "河北省沧州市吴桥县", "河北省沧州市献县", "河北省沧州市孟村回族自治县", "河北省沧州市泊头市", "河北省沧州市任丘市", "河北省沧州市黄骅市"
            , "河北省沧州市河间市", "河北省廊坊市市辖区", "河北省廊坊市安次区", "河北省廊坊市广阳区", "河北省廊坊市固安县", "河北省廊坊市永清县", "河北省廊坊市香河县", "河北省廊坊市大城县", "河北省廊坊市文安县", "河北省廊坊市大厂回族自治县"
            , "河北省廊坊市霸州市", "河北省廊坊市三河市", "河北省衡水市市辖区", "河北省衡水市桃城区", "河北省衡水市枣强县", "河北省衡水市武邑县", "河北省衡水市武强县", "河北省衡水市饶阳县", "河北省衡水市安平县", "河北省衡水市故城县"
            , "河北省衡水市景县", "河北省衡水市阜城县", "河北省衡水市冀州市", "河北省衡水市深州市", "山西省太原市市辖区", "山西省太原市小店区", "山西省太原市迎泽区", "山西省太原市杏花岭区", "山西省太原市尖草坪区", "山西省太原市万柏林区"
            , "山西省太原市晋源区", "山西省太原市清徐县", "山西省太原市阳曲县", "山西省太原市娄烦县", "山西省太原市古交市", "山西省大同市市辖区", "山西省大同市城区", "山西省大同市矿区", "山西省大同市南郊区", "山西省大同市新荣区"
            , "山西省大同市阳高县", "山西省大同市天镇县", "山西省大同市广灵县", "山西省大同市灵丘县", "山西省大同市浑源县", "山西省大同市左云县", "山西省大同市大同县", "山西省阳泉市市辖区", "山西省阳泉市城区", "山西省阳泉市矿区"
            , "山西省阳泉市郊区", "山西省阳泉市平定县", "山西省阳泉市盂县", "山西省长治市市辖区", "山西省长治市城区", "山西省长治市郊区", "山西省长治市长治县", "山西省长治市襄垣县", "山西省长治市屯留县", "山西省长治市平顺县"
            , "山西省长治市黎城县", "山西省长治市壶关县", "山西省长治市长子县", "山西省长治市武乡县", "山西省长治市沁县", "山西省长治市沁源县", "山西省长治市潞城市", "山西省晋城市市辖区", "山西省晋城市城区", "山西省晋城市沁水县"
            , "山西省晋城市阳城县", "山西省晋城市陵川县", "山西省晋城市泽州县", "山西省晋城市高平市", "山西省朔州市市辖区", "山西省朔州市朔城区", "山西省朔州市平鲁区", "山西省朔州市山阴县", "山西省朔州市应县", "山西省朔州市右玉县"
            , "山西省朔州市怀仁县", "山西省晋中市市辖区", "山西省晋中市榆次区", "山西省晋中市榆社县", "山西省晋中市左权县", "山西省晋中市和顺县", "山西省晋中市昔阳县", "山西省晋中市寿阳县", "山西省晋中市太谷县", "山西省晋中市祁县"
            , "山西省晋中市平遥县", "山西省晋中市灵石县", "山西省晋中市介休市", "山西省运城市市辖区", "山西省运城市盐湖区", "山西省运城市临猗县", "山西省运城市万荣县", "山西省运城市闻喜县", "山西省运城市稷山县", "山西省运城市新绛县"
            , "山西省运城市绛县", "山西省运城市垣曲县", "山西省运城市夏县", "山西省运城市平陆县", "山西省运城市芮城县", "山西省运城市永济市", "山西省运城市河津市", "山西省忻州市市辖区", "山西省忻州市忻府区", "山西省忻州市定襄县"
            , "山西省忻州市五台县", "山西省忻州市代县", "山西省忻州市繁峙县", "山西省忻州市宁武县", "山西省忻州市静乐县", "山西省忻州市神池县", "山西省忻州市五寨县", "山西省忻州市岢岚县", "山西省忻州市河曲县", "山西省忻州市保德县"
            , "山西省忻州市偏关县", "山西省忻州市原平市", "山西省临汾市市辖区", "山西省临汾市尧都区", "山西省临汾市曲沃县", "山西省临汾市翼城县", "山西省临汾市襄汾县", "山西省临汾市洪洞县", "山西省临汾市古县", "山西省临汾市安泽县"
            , "山西省临汾市浮山县", "山西省临汾市吉县", "山西省临汾市乡宁县", "山西省临汾市大宁县", "山西省临汾市隰县", "山西省临汾市永和县", "山西省临汾市蒲县", "山西省临汾市汾西县", "山西省临汾市侯马市", "山西省临汾市霍州市"
            , "山西省吕梁市市辖区", "山西省吕梁市离石区", "山西省吕梁市文水县", "山西省吕梁市交城县", "山西省吕梁市兴县", "山西省吕梁市临县", "山西省吕梁市柳林县", "山西省吕梁市石楼县", "山西省吕梁市岚县", "山西省吕梁市方山县"
            , "山西省吕梁市中阳县", "山西省吕梁市交口县", "山西省吕梁市孝义市", "山西省吕梁市汾阳市", "内蒙古自治区呼和浩特市市辖区", "内蒙古自治区呼和浩特市新城区", "内蒙古自治区呼和浩特市回民区", "内蒙古自治区呼和浩特市玉泉区", "内蒙古自治区呼和浩特市赛罕区", "内蒙古自治区呼和浩特市土默特左旗"
            , "内蒙古自治区呼和浩特市托克托县", "内蒙古自治区呼和浩特市和林格尔县", "内蒙古自治区呼和浩特市清水河县", "内蒙古自治区呼和浩特市武川县", "内蒙古自治区包头市市辖区", "内蒙古自治区包头市东河区", "内蒙古自治区包头市昆都仑区", "内蒙古自治区包头市青山区", "内蒙古自治区包头市石拐区", "内蒙古自治区包头市白云矿区"
            , "内蒙古自治区包头市九原区", "内蒙古自治区包头市土默特右旗", "内蒙古自治区包头市固阳县", "内蒙古自治区包头市达尔罕茂明安联合旗", "内蒙古自治区乌海市市辖区", "内蒙古自治区乌海市海勃湾区", "内蒙古自治区乌海市海南区", "内蒙古自治区乌海市乌达区", "内蒙古自治区赤峰市市辖区", "内蒙古自治区赤峰市红山区"
            , "内蒙古自治区赤峰市元宝山区", "内蒙古自治区赤峰市松山区", "内蒙古自治区赤峰市阿鲁科尔沁旗", "内蒙古自治区赤峰市巴林左旗", "内蒙古自治区赤峰市巴林右旗", "内蒙古自治区赤峰市林西县", "内蒙古自治区赤峰市克什克腾旗", "内蒙古自治区赤峰市翁牛特旗", "内蒙古自治区赤峰市喀喇沁旗", "内蒙古自治区赤峰市宁城县"
            , "内蒙古自治区赤峰市敖汉旗", "内蒙古自治区通辽市市辖区", "内蒙古自治区通辽市科尔沁区", "内蒙古自治区通辽市科尔沁左翼中旗", "内蒙古自治区通辽市科尔沁左翼后旗", "内蒙古自治区通辽市开鲁县", "内蒙古自治区通辽市库伦旗", "内蒙古自治区通辽市奈曼旗", "内蒙古自治区通辽市扎鲁特旗", "内蒙古自治区通辽市霍林郭勒市"
            , "内蒙古自治区鄂尔多斯市东胜区", "内蒙古自治区鄂尔多斯市达拉特旗", "内蒙古自治区鄂尔多斯市准格尔旗", "内蒙古自治区鄂尔多斯市鄂托克前旗", "内蒙古自治区鄂尔多斯市鄂托克旗", "内蒙古自治区鄂尔多斯市杭锦旗", "内蒙古自治区鄂尔多斯市乌审旗", "内蒙古自治区鄂尔多斯市伊金霍洛旗", "内蒙古自治区呼伦贝尔市市辖区", "内蒙古自治区呼伦贝尔市海拉尔区"
            , "内蒙古自治区呼伦贝尔市阿荣旗", "内蒙古自治区呼伦贝尔市莫力达瓦达斡尔族自治旗", "内蒙古自治区呼伦贝尔市鄂伦春自治旗", "内蒙古自治区呼伦贝尔市鄂温克族自治旗", "内蒙古自治区呼伦贝尔市陈巴尔虎旗", "内蒙古自治区呼伦贝尔市新巴尔虎左旗", "内蒙古自治区呼伦贝尔市新巴尔虎右旗", "内蒙古自治区呼伦贝尔市满洲里市", "内蒙古自治区呼伦贝尔市牙克石市", "内蒙古自治区呼伦贝尔市扎兰屯市"
            , "内蒙古自治区呼伦贝尔市额尔古纳市", "内蒙古自治区呼伦贝尔市根河市", "内蒙古自治区巴彦淖尔市市辖区", "内蒙古自治区巴彦淖尔市临河区", "内蒙古自治区巴彦淖尔市五原县", "内蒙古自治区巴彦淖尔市磴口县", "内蒙古自治区巴彦淖尔市乌拉特前旗", "内蒙古自治区巴彦淖尔市乌拉特中旗", "内蒙古自治区巴彦淖尔市乌拉特后旗"
            , "内蒙古自治区巴彦淖尔市杭锦后旗", "内蒙古自治区乌兰察布市市辖区", "内蒙古自治区乌兰察布市集宁区", "内蒙古自治区乌兰察布市卓资县", "内蒙古自治区乌兰察布市化德县", "内蒙古自治区乌兰察布市商都县", "内蒙古自治区乌兰察布市兴和县", "内蒙古自治区乌兰察布市凉城县", "内蒙古自治区乌兰察布市察哈尔右翼前旗"
            , "内蒙古自治区乌兰察布市察哈尔右翼中旗", "内蒙古自治区乌兰察布市察哈尔右翼后旗", "内蒙古自治区乌兰察布市四子王旗", "内蒙古自治区乌兰察布市丰镇市", "内蒙古自治区兴安盟乌兰浩特市", "内蒙古自治区兴安盟阿尔山市", "内蒙古自治区兴安盟科尔沁右翼前旗", "内蒙古自治区兴安盟科尔沁右翼中旗", "内蒙古自治区兴安盟扎赉特旗", "内蒙古自治区兴安盟突泉县"
            , "内蒙古自治区锡林郭勒盟二连浩特市", "内蒙古自治区锡林郭勒盟锡林浩特市", "内蒙古自治区锡林郭勒盟阿巴嘎旗", "内蒙古自治区锡林郭勒盟苏尼特左旗", "内蒙古自治区锡林郭勒盟苏尼特右旗", "内蒙古自治区锡林郭勒盟东乌珠穆沁旗", "内蒙古自治区锡林郭勒盟西乌珠穆沁旗", "内蒙古自治区锡林郭勒盟太仆寺旗", "内蒙古自治区锡林郭勒盟镶黄旗", "内蒙古自治区锡林郭勒盟正镶白旗"
            , "内蒙古自治区锡林郭勒盟正蓝旗", "内蒙古自治区锡林郭勒盟多伦县", "内蒙古自治区阿拉善盟阿拉善左旗", "内蒙古自治区阿拉善盟阿拉善右旗", "内蒙古自治区阿拉善盟额济纳旗", "辽宁省沈阳市市辖区", "辽宁省沈阳市和平区", "辽宁省沈阳市沈河区", "辽宁省沈阳市大东区", "辽宁省沈阳市皇姑区", "辽宁省沈阳市铁西区"
            , "辽宁省沈阳市苏家屯区", "辽宁省沈阳市东陵区", "辽宁省沈阳市新城子区", "辽宁省沈阳市于洪区", "辽宁省沈阳市辽中县", "辽宁省沈阳市康平县", "辽宁省沈阳市法库县", "辽宁省沈阳市新民市", "辽宁省大连市市辖区", "辽宁省大连市中山区", "辽宁省大连市西岗区"
            , "辽宁省大连市沙河口区", "辽宁省大连市甘井子区", "辽宁省大连市旅顺口区", "辽宁省大连市金州区", "辽宁省大连市长海县", "辽宁省大连市瓦房店市", "辽宁省大连市普兰店市", "辽宁省大连市庄河市", "辽宁省鞍山市市辖区", "辽宁省鞍山市铁东区", "辽宁省鞍山市铁西区", "辽宁省鞍山市立山区"
            , "辽宁省鞍山市千山区", "辽宁省鞍山市台安县", "辽宁省鞍山市岫岩满族自治县", "辽宁省鞍山市海城市", "辽宁省抚顺市市辖区", "辽宁省抚顺市新抚区", "辽宁省抚顺市东洲区", "辽宁省抚顺市望花区", "辽宁省抚顺市顺城区", "辽宁省抚顺市抚顺县", "辽宁省抚顺市新宾满族自治县", "辽宁省抚顺市清原满族自治县"
            , "辽宁省本溪市市辖区", "辽宁省本溪市平山区", "辽宁省本溪市溪湖区", "辽宁省本溪市明山区", "辽宁省本溪市南芬区", "辽宁省本溪市本溪满族自治县"
    } ;


}